In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
data=pd.read_csv('titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,...,Embarked,WikiId,Name_wiki,Age_wiki,Hometown,Boarded,Destination,Lifeboat,Body,Class
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,...,S,691.0,"Braund, Mr. Owen Harris",22.0,"Bridgerule, Devon, England",Southampton,"Qu'Appelle Valley, Saskatchewan, Canada",NaN,NaN,3.0
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,...,C,90.0,"Cumings, Mrs. Florence Briggs (née Thayer)",35.0,"New York, New York, US",Cherbourg,"New York, New York, US",4,NaN,1.0
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,...,S,865.0,"Heikkinen, Miss Laina",26.0,"Jyväskylä, Finland",Southampton,New York City,14?,NaN,3.0
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,...,S,127.0,"Futrelle, Mrs. Lily May (née Peel)",35.0,"Scituate, Massachusetts, US",Southampton,"Scituate, Massachusetts, US",D,NaN,1.0
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,...,S,627.0,"Allen, Mr. William Henry",35.0,"Birmingham, West Midlands, England",Southampton,New York City,NaN,NaN,3.0

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 21 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  1309 non-null   int64
 1   Survived     891 non-null    float64
 2   Pclass       1309 non-null   int64
 3   Name         1309 non-null   object
 4   Sex          1309 non-null   object
 5   Age          1046 non-null   float64
 6   SibSp        1309 non-null   int64
 7   Parch        1309 non-null   int64
 8   Ticket       1309 non-null   object
 9   Fare         1308 non-null   float64
 10  Cabin        295 non-null    object
 11  Embarked     1307 non-null   object
 12  WikiId       1304 non-null   float64
 13  Name_wiki    1304 non-null   object
 14  Age_wiki     1302 non-null   float64
 15  Hometown     1304 non-null   object
 16  Boarded      1304 non-null   object
 17  Destination  1304 non-null   object
 18  Lifeboat     502 non-null    object
 19  Body         130 non-null    object
 20  Class        1304 non-null   float64
dtypes: float64(6), int64(4), object(11)
memory usage: 214.9+ KB

### Number of passengers in each class

In [21]:
data.Pclass.value_counts()

3    709
1    323
2    277
Name: Pclass, dtype: int64

### number of persons survived

In [11]:
pclass_survived=data.groupby(['Pclass'])['Survived']

In [13]:
pclass_survived.sum()

Pclass
1    136.0
2     87.0
3    119.0
Name: Survived, dtype: float64

### multiple columns

#### total amount paid by each class survived

In [14]:
pclass_survived_fare=data.groupby(['Pclass'])['Survived','Fare']

In [15]:
pclass_survived_fare.sum()

        Survived        Fare
Pclass
1          136.0  28265.4043
2           87.0   5866.6374
3          119.0   9418.4452

### Multiple groups

#### count of females and males survived in each class

In [22]:
pclass_sex_survived=data.groupby(['Pclass','Sex'])['Survived']

In [17]:
pclass_sex_survived.sum()

Pclass  Sex
1       female    91.0
        male      45.0
2       female    70.0
        male      17.0
3       female    72.0
        male      47.0
Name: Survived, dtype: float64

In [26]:
pclass_sex_survived=data.groupby(['Pclass','Sex'],as_index=False)['Survived']

In [24]:
pclass_sex_survived.sum()

   Pclass     Sex  Survived
0       1  female      91.0
1       1    male      45.0
2       2  female      70.0
3       2    male      17.0
4       3  female      72.0
5       3    male      47.0

### Multiple functions

#### Mean and sum of pclass and survived

In [28]:
pclass_survived_mean_sum=data.groupby(['Pclass'])['Survived'].agg(['mean','sum'])

In [19]:
pclass_survived_mean_sum

            mean    sum
Pclass
1       0.629630  136.0
2       0.472826   87.0
3       0.242363  119.0

In [32]:
pclass_destination=data.groupby(['Pclass'])['Destination']

In [31]:
pclass_destination.sum()

Pclass
1    New York, New York, USScituate, Massachusetts,...
2    Cleveland, Ohio, USRapid City, South Dakota, U...
3    Qu'Appelle Valley, Saskatchewan, CanadaNew Yor...
Name: Destination, dtype: object

In [33]:
pclass_destination_survived=data.groupby(['Pclass','Destination'])['Survived']

In [35]:
pclass_destination_survived.sum()

Pclass  Destination
1       Albany, New York, US              0.0
        Amenia, North Dakota, US          0.0
        Belmont, Massachusetts, US        0.0
        Bennington, Vermont, US           0.0
        Boston, Massachusetts, US         1.0
                                         ...
3       Wilkes-Barre, Pennsylvania, US    3.0
        Winnipeg, Manitoba, Canada        0.0
        Worcester, Massachusetts, US      3.0
        Yonkers, New York, US             0.0
        Youngstown, Ohio, US              0.0
Name: Survived, Length: 366, dtype: float64

In [44]:
sex_age=data.groupby(['Sex'])['Age']

In [46]:
sex_age.sum()

Sex
female    11130.59
male      20125.08
Name: Age, dtype: float64

In [47]:
data.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
WikiId            5
Name_wiki         5
Age_wiki          7
Hometown          5
Boarded           5
Destination       5
Lifeboat        807
Body           1179
Class             5
dtype: int64